In [1]:
import pandas as pd

In [2]:
seriesdata= pd.Series([70,60,90])

In [3]:
seriesdata

0    70
1    60
2    90
dtype: int64

In [4]:
seriesdata = pd.Series([70,60,90], index=['국어', '영어', '수학'])

In [5]:
seriesdata

국어    70
영어    60
수학    90
dtype: int64

In [6]:
#series data 읽고 수정하기
seriesdata.index

Index(['국어', '영어', '수학'], dtype='object')

In [7]:
seriesdata.index=['미술', '음악', '체육']

In [8]:
seriesdata

미술    70
음악    60
체육    90
dtype: int64

In [9]:
seriesdata.values

array([70, 60, 90], dtype=int64)

In [10]:
print(seriesdata['미술'], seriesdata[0])

70 70

In [11]:
seriesdata['미술']=80
print(seriesdata['미술'], seriesdata[0])

80 80

In [12]:
seriesdata

미술    80
음악    60
체육    90
dtype: int64

In [13]:
del seriesdata['미술']

In [14]:
seriesdata

음악    60
체육    90
dtype: int64

In [15]:
seriesdata = pd.Series(['dave', 'alex', 'amir'])
seriesdata

0    dave
1    alex
2    amir
dtype: object

In [16]:
seriesdata= pd.Series([1,1,1])

In [17]:
seriesdata

0    1
1    1
2    1
dtype: int64

In [18]:
seriesdata.astype('float')

0    1.0
1    1.0
2    1.0
dtype: float64

In [19]:
seriesdata = pd.Series([True, True, False])
seriesdata

0     True
1     True
2    False
dtype: bool

In [20]:
seriesdata.astype('float')

0    1.0
1    1.0
2    0.0
dtype: float64

In [22]:
df= pd.DataFrame({
    "미국": [2.1,2.2,2.3],
    "한국": [0.4,0.5,0.45],
    "중국": [10,13, 15]
})
df

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.50  13
2  2.3  0.45  15

In [28]:
df= pd.DataFrame({
    "미국": [2.1,2.2,2.3],
    "한국": [0.4,0.5,0.45],
    "중국": [10,13, 15]
},
    index=[2000,2010,2020]
)
df

       미국    한국  중국
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [29]:
df.index

Int64Index([2000, 2010, 2020], dtype='int64')

In [30]:
df.index=[2001,2002,2003]

In [31]:
df.columns

Index(['미국', '한국', '중국'], dtype='object')

In [32]:
df.columns=['일본', '필리핀', '러시아']

In [33]:
df.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.5 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [42]:
#인덱스로 특정 컬럼 선택하기
df = pd.DataFrame({
    "연도" : [2000,2010,2020],
    "미국" : [2.1, 2.2, 2.3],
    "한국" : [0.4, 0.5, 0.45],
    "중국" : [10, 13, 15]
})
df

     연도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.50  13
2  2020  2.3  0.45  15

In [43]:
#index 컬럼도 컬럼의 이름이 있다.
df = df.set_index("연도")
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [44]:
df.index.name

'연도'

In [45]:
df = df.reset_index("연도")

In [46]:
df

     연도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.50  13
2  2020  2.3  0.45  15

In [51]:
#특정 행 가져오기 loc(index) / iloc (index 번호로)
df=df.set_index("연도")
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [52]:
df.loc[2000]

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [53]:
df.iloc[0]

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [54]:
df['미국']

연도
2000    2.1
2010    2.2
2020    2.3
Name: 미국, dtype: float64

In [55]:
print(df['미국'][2000])
print(df.loc[2000]['미국'])

2.1
2.1

In [56]:
#dataframe 컬럼 추가
df['일본'] = [1,2,3]

NameError: name 'ᄋᄅ' is not defined

In [58]:
df

       미국    한국  중국  일본
연도
2000  2.1  0.40  10   1
2010  2.2  0.50  13   2
2020  2.3  0.45  15   3

In [59]:
del df['일본']

In [60]:
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [61]:
df.loc[2021]=[1,2,3]

In [62]:
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15
2021  1.0  2.00   3

In [64]:
df.drop([2020])

       미국   한국  중국
연도
2000  2.1  0.4  10
2010  2.2  0.5  13
2021  1.0  2.0   3

In [65]:
#dataframe 컬럼 선택(복사)
#복사본을 이용하여 조작하는 경우가 많다.
df2=df[['중국','한국']].copy()

In [66]:
df2

      중국    한국
연도
2000  10  0.40
2010  13  0.50
2020  15  0.45
2021   3  2.00

In [67]:
df2.columns=['브라질', '아르헨티나']

In [68]:
df2

      브라질  아르헨티나
연도
2000   10   0.40
2010   13   0.50
2020   15   0.45
2021    3   2.00

In [69]:
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15
2021  1.0  2.00   3